tests/performance/load-test-config.yml
# Artillery Load Testing Configuration for HeyMax Shop Bot
# Sprint 3: Load Testing & Performance Validation for Viral Scenarios

config:
  target: "http://localhost:54321/functions/v1/telegram-bot"
  phases:
    # Phase 1: Warm-up
    - duration: 30
      arrivalRate: 2
      name: "Warm-up phase"
    # Phase 2: Ramp up load
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Ramp up load"
    # Phase 3: Sustained load (viral scenario)
    - duration: 120
      arrivalRate: 20
      name: "Sustained viral load"
    # Phase 4: Peak viral scenario
    - duration: 60
      arrivalRate: 30
      name: "Peak viral scenario"
    # Phase 5: Cool down
    - duration: 30
      arrivalRate: 5
      name: "Cool down"

  payload:
    path: "load-test-data.json"

  defaults:
    headers:
      Content-Type: "application/json"
      Authorization: "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZS1kZW1vIiwicm9sZSI6ImFub24iLCJleHAiOjE5ODM4MTI5OTZ9.CRXP1A7WOeoJeXxjNni43kdQwgnWNReilDMblYTn_I0"

  # Performance thresholds
  ensure:
    maxErrorRate: 1 # Max 1% error rate
    maxResponseTime: 1000 # Max 1s response time
    minRequestRate: 15 # Min 15 requests/second during sustained load

scenarios:
  - name: "Inline Query Load Test"
    weight: 70
    flow:
      - post:
          url: "/"
          json:
            update_id: "{{ $randomInt(1000000, 9999999) }}"
            inline_query:
              id: "{{ $randomString() }}"
              from:
                id: "{{ $randomInt(100000, 999999) }}"
                is_bot: false
                first_name: "LoadTestUser{{ $randomInt() }}"
                username: "loadtest_{{ $randomInt(1000, 9999) }}"
              query: "{{ random(['shopee', 'grab', 'klook', 'pelago', 'apple', '', 'lazada', 'starbucks']) }}"
              offset: ""
      - think: 1

  - name: "Viral Button Callback Test"
    weight: 25
    flow:
      - post:
          url: "/"
          json:
            update_id: "{{ $randomInt(1000000, 9999999) }}"
            callback_query:
              id: "{{ $randomString() }}"
              from:
                id: "{{ $randomInt(100000, 999999) }}"
                is_bot: false
                first_name: "ViralUser{{ $randomInt() }}"
                username: "viral_{{ $randomInt(1000, 9999) }}"
              data: "generate:shopee-singapore:{{ $randomInt(100000, 999999) }}"
              chat_instance: "{{ $randomString() }}"
              message:
                message_id: "{{ $randomInt(1, 1000) }}"
                chat:
                  id: "{{ $randomInt(-1000000, -1) }}"
                  type: "supergroup"
      - think: 2

  - name: "Start Command Test"
    weight: 5
    flow:
      - post:
          url: "/"
          json:
            update_id: "{{ $randomInt(1000000, 9999999) }}"
            message:
              message_id: "{{ $randomInt(1, 1000) }}"
              from:
                id: "{{ $randomInt(100000, 999999) }}"
                is_bot: false
                first_name: "NewUser{{ $randomInt() }}"
                username: "new_{{ $randomInt(1000, 9999) }}"
              chat:
                id: "{{ $randomInt(100000, 999999) }}"
                type: "private"
              text: "/start"
      - think: 1